
import pytest
from calculating import Calculator


def test_is_valid():
    
    pythonCalculator = Calculator()
    
    assert pythonCalculator.is_valid('2-2-5') == True
    assert pythonCalculator.is_valid('2-2-5') == True
    assert pythonCalculator.is_valid('999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999-999999999999999999999999999999999999999999999999999999999999999999999999999') == True

    assert pythonCalculator.is_valid("a̵̧̖͎̟̣̲͔̩͈͕͇͙̱̪̯̥͇̙͇͎̜͙̱͙̠̣̭͈͒̈́̔̂̈́̐͛̀͗̀̌̓̊̌́͌͋́̀͜͝͝͝d̶͖͎̻̀̀̽̑͌̍̏̅͗̚;̷̢̡̧͇͇̤͓͚͓͕̪̺̤̪̱͖͇̲̗̻̺̩̼͗͋̏̀̓̄̽̂͆͌͝l̶̨̩̯̣͕̩̳̯͕̳̥̐͛͗͆͊̿̐̒̄̃̓̓̀̅͊͐́̚̕̕͝s̵̤͍̤̪͈͖̙͕̠̥̭͓͆̈́̅̒̀̽̐̃͌̇̐́͊̊̑̿̅̂̄̈̆̇̚͝j̵̡̡̟̞͍̰̺̯̃̿͊̅̀͋̆̒̔̽͊̋̿̐̌͜ͅf̸̨̢̬̠̙͒͐͌̅͗͒̉̽͑͛̉͐͂͑̀́͛̋͒͋̔̕̚̕͝ͅg̷̢̭̺̞̘̟̰̱̲̜̦̽̉͊͊͋̆̅͐̅͑͊͂͗̅̓̈́̒͛̍̒̀͘͠ḩ̴͙̯̥̠̩̘̙̥̮̩̰̙̺̦̗̿̓̉͛͐̿̄̾̂͒̇̊̃̍͌̄́̕͘͝͝ͅͅj̸̢̜̤͖̻̹̹̩̣͚̺̘̖͎̯͈̎͆̉̃͛̓̐̓̾́̔̽̔̎̈̊̑̀͛̓͂̀̚̚͜͠ö̴͇̦̯͈͎̠͕̞͕͖͖̘͓̣̦̪͔̬̳̹͍̹̩̻̺͛̇̓ͅȩ̶͙̣̖̪͔͎͉͇̲̓̆̃̽́͐ͅw̷̗̲̒͗̂͑̍́͗̔͐̕͠r̷̘͐̎͌͆͗͛̿͒̈́͐̀ṳ̸̹̘͉̼̱̪̪̺͖̭͈͖̝̙͕̤̳̻̿̓͐͛́̏͆̈́͂͂̀͗̏͐̀̐̀̎͋͂̔̂͜͝ǐ̸̛͔̉́͌̉͂́̒̾̐́͊͐͒͗͐̿̾͐̇̓̔̚̕͘̚͠ȓ̴̛͉͈̞̰̼̦͖͖̇̀̊̃͊̌̇̂ͅủ̸̬̇́͗͊͌̾̍̒̈́̇̋͗̐̂͘̕x̷͇͍̳̱̩̘͇͆̌̑̊̔̓̒̒͂̈́̓̔̋͝͝ͅ.̵̯͙̋̽̊̏̊c̶̡̧̣̜̞̣̪̙̱̓͒̓͗̓͋͐̿̈́͆̂͜͝v̸̨̧̨͉͍͓͔̯͆̊̆̌͐̏m̶̧͕̺̞̻̰͓̬̤̣̺͚͎̝͕̜̮̪̮̥̮͉̺̼̭͗͆̀̂̽̽̔̄͛̊̓͑̇̅̃̈́̍͗̌͊̇͑̕͘͜͜͝͝͝ ̵̛̛̲̦̻͖̟͚̗̱̥̗̜̓̽̓̓̑̊̽͆̆͑̀̾̔̆̽̍̈́̽̐̑̕͘;̸̨̛̠̰̳̬̺̮̺͎͜x̷̘̑͛̿̇̈́̌̿̑̀ç̴̼̖̪̙̩̍́̆l̷̩̺͍̠̻̯͎̱̀̉́͗̿͌̉̈́̿̇̚͜͝ͅķ̵̢̛͍͔͈̤̺͓͈̪̫̤͕͉̱̺̰́̈́͆͗̊͊͛͌͑͊͗̂͗̒͑̔͑͛̇͌͌̃̅͌͝͝;̸̨̨̫̗̮̞̬͔̯̲̦̥̥̹̺̙̪̦͎̓̅͂̓͂̋͜͝d̸̩͖͎̼̺̂̈́͊̉̾͑̽͌̓f̸̢̧̨̧̗̬̦̠̮̞̰̯̬̲̗̯̭̲̗̼͇̟̱̺̱̱̦̠̿̔́̃͑̓͋̽͌̈́͆͊̍̌̌́̈́̽̆̄̾̌͐̂̔̇̏̕͝ͅǫ̷͕̩̱̭̠͓̻͈̠̙̽͆̎̊̈́͑̇̓̓́͊͊͑̒̇̍̊̚̕̚͘͜͜͜͝͝͝;̷̭̋͋͋͂̑̇́̆̀̓̇̂̌̄̀͑͆̀̐̆̀͛͐͛̏̌̽͠͠ḑ̶̮͖̬͓̪̟͇̙̰̓́̄̈́̈ş̵̭̪͙͎̳̩̟̠̯̲̻̖̮͕̖͚̤͚̪̆͌̓͌̃̈́̌̀́͐͒̑̎͗͘͜ḟ̵̧̨̧̛̞͕̘̪͙͎̊̐̄́̀̈́̏̏̏̐͑̔͋́̾̐͐̾̿̑̄͆̓̈̇͜͝͝ͅk̶̡̡̢̪̭̗͇̤̗̭̞̗͍̺̟͇̫͉̰̝̺̊͆̌̅̔̃̍̎̐̇̒̑͋̆͆̓̿̆̐̇̅͒͒͌̋͘͘͘͜͠͝;̴̢̡͇̪̞̜̟͓̩̻̬̲̲̘͓̼̥͇̦̫̲̼̌͂͗͛̓̍̐̈́̕͜s̷̡̛͙̠̻͚͓̯̹̠̤͔͕͚̬̞̺̟̪͙̭̟̩̈̎̀͒̿̂̾̉́͐͗͒̄̽̿̏̊̋̉̏͜͝͝͝͝d̵̡̢̡̢͙̦̟̘̙̦͎̙̱͉̠͎̣̗̗̺͎͉̯̤͈̖͊͋̈̆̇͋̃́͛͆̅̀̉̊͘͠͝ͅͅf̸̨̤͍͖̲͍̗̩̬̫̙̺̓̅͛́̐̌̿̈͠͝l̶̡̟̥̜͎̱̽̋́͒̆̓̿̈͂͂̌̈́̉̈̋͛̓̂̽̕k̴̨̢̢̹͖̩͉͍̮̹̞̔́̑͊̇͂̄͆̈́̿̓̓́̾͌̂̉̈́̇̉̉̀͗̎̌͑͒̏͝͝s̸̢̨̛̫̖͔̞̹̯̻̟̠̞̹̺̤̉̈́̔̂̌͌̒͂͛̓̈́̓͌͗͘͝͝d̸̨̢̧̡̛͚̱̯̮͖̳̻͓̗̩̂͐͆͛̉̿́̑̃̾̉̅̓̿͂͂̓͌̓̿͋͑̽̾̈͘͘͠͝ͅ;̴̧̢̢̢̛̦̤̣͎͉͔̠̠͔̲͙͖͈̝̣̺̱̤͔̒̀̊̽̓̾̃̀̽͛f̵̭̟͓̝͎̔̃͗͗̃̓̒͒̈́͑͑̊͋̐͂͊̃̊̈́̈̓̋̏̕̚͜͜͝͝ļ̷̩̖̭͍͇̜̙͕̼̯͔̯̮̮̭̜̈͌̊͑͋̋͛̔̚͘͠k̷̨̢̛̝̙̫̹̱͈̟̥͕̰̼̼̲͈̝̗̳̞̺͈̀́̐͂͋̀͒͋̈͆̾͐́̐s̴̢͔̥̺͙̖̿́̅͘̕ḑ̶̨̛̮̯̪̭̰̤̞̣̻̩̱̂͑͋̓̓̈́̇͂̈́͑̓̈̒̔̂̈́̏̕̚͘͠͠;̷̧̱̗̮̗̥̯̜͙̣̟͓͚̲͓̹̫̠̤̻̬̔͆̾̄͌͑̊̆͂̑͋͋̓͆̎͌̀͆̀̓̿̚͘̚͘͠͠͠ͅf̶̛̠̣͚̳͖͚̈̉͌͐͑̀͛͑̿͝͝͝k̷̨̡̢̛͔̰̗͉̺͚̳͓̺̹͙̈́̐̃̽̈́́̒̈̒͆̽̿͌̈́̓̈̄̾̚") == False 
    assert pythonCalculator.is_valid('👺🍮🍮🍮🍮🍮🍮🍮🍮  Δⓓ;ㄥ𝕤נ𝒇𝕘нנ𝐨𝔼ฬⓇυเʳｕˣ.ᑕνᵐ ;ⓧＣ𝕃𝓴;đғ𝓸;∂ŜｆҜ;Ŝ𝒹ℱĻк𝕊Ⓓ;ᖴｌＫ𝓼Đ;Ｆк  🎯🎄') == False
    assert pythonCalculator.is_valid("شسزذدسيپويريل؛سدلفكسد؛لفكچ.،ڢمخ.،ڢمخ.ڢم؛اسدك؛اسلدكد") == False
    assert pythonCalculator.is_valid('2-2-5') == True
    assert pythonCalculator.is_valid('2*(3+5)') == True

# Failed tests that have to be resolved tomorrow 
@pytest.mark.xfail
def test_is_not_valid():
    
    pythonCalculator = Calculator()
    
    with pytest.raises(ZeroDivisionError):
        pythonCalculator.is_valid('3/0')
    
    with pytest.raises(SyntaxError):
        pythonCalculator.is_valid('print("Hello World")')


    assert pythonCalculator.is_valid('(3+5') == False 
    assert pythonCalculator.is_valid("!@#$%^&*()_/**-+]=,.;/") == True     
    



    
