
from calculating import is_valid, calculate

def test_is_valid():
    assert is_valid('2-2-5') == True
    assert is_valid('print("Hello World")') == False
    assert is_valid('2-2-5') == True
    assert is_valid('print("Hello World")') == False
    assert is_valid('999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999-999999999999999999999999999999999999999999999999999999999999999999999999999') == True
    assert is_valid("!@#$%^&*()_/**-+]=,.;/") == False
    assert is_valid("a̵̧̖͎̟̣̲͔̩͈͕͇͙̱̪̯̥͇̙͇͎̜͙̱͙̠̣̭͈͒̈́̔̂̈́̐͛̀͗̀̌̓̊̌́͌͋́̀͜͝͝͝d̶͖͎̻̀̀̽̑͌̍̏̅͗̚;̷̢̡̧͇͇̤͓͚͓͕̪̺̤̪̱͖͇̲̗̻̺̩̼͗͋̏̀̓̄̽̂͆͌͝l̶̨̩̯̣͕̩̳̯͕̳̥̐͛͗͆͊̿̐̒̄̃̓̓̀̅͊͐́̚̕̕͝s̵̤͍̤̪͈͖̙͕̠̥̭͓͆̈́̅̒̀̽̐̃͌̇̐́͊̊̑̿̅̂̄̈̆̇̚͝j̵̡̡̟̞͍̰̺̯̃̿͊̅̀͋̆̒̔̽͊̋̿̐̌͜ͅf̸̨̢̬̠̙͒͐͌̅͗͒̉̽͑͛̉͐͂͑̀́͛̋͒͋̔̕̚̕͝ͅg̷̢̭̺̞̘̟̰̱̲̜̦̽̉͊͊͋̆̅͐̅͑͊͂͗̅̓̈́̒͛̍̒̀͘͠ḩ̴͙̯̥̠̩̘̙̥̮̩̰̙̺̦̗̿̓̉͛͐̿̄̾̂͒̇̊̃̍͌̄́̕͘͝͝ͅͅj̸̢̜̤͖̻̹̹̩̣͚̺̘̖͎̯͈̎͆̉̃͛̓̐̓̾́̔̽̔̎̈̊̑̀͛̓͂̀̚̚͜͠ö̴͇̦̯͈͎̠͕̞͕͖͖̘͓̣̦̪͔̬̳̹͍̹̩̻̺͛̇̓ͅȩ̶͙̣̖̪͔͎͉͇̲̓̆̃̽́͐ͅw̷̗̲̒͗̂͑̍́͗̔͐̕͠r̷̘͐̎͌͆͗͛̿͒̈́͐̀ṳ̸̹̘͉̼̱̪̪̺͖̭͈͖̝̙͕̤̳̻̿̓͐͛́̏͆̈́͂͂̀͗̏͐̀̐̀̎͋͂̔̂͜͝ǐ̸̛͔̉́͌̉͂́̒̾̐́͊͐͒͗͐̿̾͐̇̓̔̚̕͘̚͠ȓ̴̛͉͈̞̰̼̦͖͖̇̀̊̃͊̌̇̂ͅủ̸̬̇́͗͊͌̾̍̒̈́̇̋͗̐̂͘̕x̷͇͍̳̱̩̘͇͆̌̑̊̔̓̒̒͂̈́̓̔̋͝͝ͅ.̵̯͙̋̽̊̏̊c̶̡̧̣̜̞̣̪̙̱̓͒̓͗̓͋͐̿̈́͆̂͜͝v̸̨̧̨͉͍͓͔̯͆̊̆̌͐̏m̶̧͕̺̞̻̰͓̬̤̣̺͚͎̝͕̜̮̪̮̥̮͉̺̼̭͗͆̀̂̽̽̔̄͛̊̓͑̇̅̃̈́̍͗̌͊̇͑̕͘͜͜͝͝͝ ̵̛̛̲̦̻͖̟͚̗̱̥̗̜̓̽̓̓̑̊̽͆̆͑̀̾̔̆̽̍̈́̽̐̑̕͘;̸̨̛̠̰̳̬̺̮̺͎͜x̷̘̑͛̿̇̈́̌̿̑̀ç̴̼̖̪̙̩̍́̆l̷̩̺͍̠̻̯͎̱̀̉́͗̿͌̉̈́̿̇̚͜͝ͅķ̵̢̛͍͔͈̤̺͓͈̪̫̤͕͉̱̺̰́̈́͆͗̊͊͛͌͑͊͗̂͗̒͑̔͑͛̇͌͌̃̅͌͝͝;̸̨̨̫̗̮̞̬͔̯̲̦̥̥̹̺̙̪̦͎̓̅͂̓͂̋͜͝d̸̩͖͎̼̺̂̈́͊̉̾͑̽͌̓f̸̢̧̨̧̗̬̦̠̮̞̰̯̬̲̗̯̭̲̗̼͇̟̱̺̱̱̦̠̿̔́̃͑̓͋̽͌̈́͆͊̍̌̌́̈́̽̆̄̾̌͐̂̔̇̏̕͝ͅǫ̷͕̩̱̭̠͓̻͈̠̙̽͆̎̊̈́͑̇̓̓́͊͊͑̒̇̍̊̚̕̚͘͜͜͜͝͝͝;̷̭̋͋͋͂̑̇́̆̀̓̇̂̌̄̀͑͆̀̐̆̀͛͐͛̏̌̽͠͠ḑ̶̮͖̬͓̪̟͇̙̰̓́̄̈́̈ş̵̭̪͙͎̳̩̟̠̯̲̻̖̮͕̖͚̤͚̪̆͌̓͌̃̈́̌̀́͐͒̑̎͗͘͜ḟ̵̧̨̧̛̞͕̘̪͙͎̊̐̄́̀̈́̏̏̏̐͑̔͋́̾̐͐̾̿̑̄͆̓̈̇͜͝͝ͅk̶̡̡̢̪̭̗͇̤̗̭̞̗͍̺̟͇̫͉̰̝̺̊͆̌̅̔̃̍̎̐̇̒̑͋̆͆̓̿̆̐̇̅͒͒͌̋͘͘͘͜͠͝;̴̢̡͇̪̞̜̟͓̩̻̬̲̲̘͓̼̥͇̦̫̲̼̌͂͗͛̓̍̐̈́̕͜s̷̡̛͙̠̻͚͓̯̹̠̤͔͕͚̬̞̺̟̪͙̭̟̩̈̎̀͒̿̂̾̉́͐͗͒̄̽̿̏̊̋̉̏͜͝͝͝͝d̵̡̢̡̢͙̦̟̘̙̦͎̙̱͉̠͎̣̗̗̺͎͉̯̤͈̖͊͋̈̆̇͋̃́͛͆̅̀̉̊͘͠͝ͅͅf̸̨̤͍͖̲͍̗̩̬̫̙̺̓̅͛́̐̌̿̈͠͝l̶̡̟̥̜͎̱̽̋́͒̆̓̿̈͂͂̌̈́̉̈̋͛̓̂̽̕k̴̨̢̢̹͖̩͉͍̮̹̞̔́̑͊̇͂̄͆̈́̿̓̓́̾͌̂̉̈́̇̉̉̀͗̎̌͑͒̏͝͝s̸̢̨̛̫̖͔̞̹̯̻̟̠̞̹̺̤̉̈́̔̂̌͌̒͂͛̓̈́̓͌͗͘͝͝d̸̨̢̧̡̛͚̱̯̮͖̳̻͓̗̩̂͐͆͛̉̿́̑̃̾̉̅̓̿͂͂̓͌̓̿͋͑̽̾̈͘͘͠͝ͅ;̴̧̢̢̢̛̦̤̣͎͉͔̠̠͔̲͙͖͈̝̣̺̱̤͔̒̀̊̽̓̾̃̀̽͛f̵̭̟͓̝͎̔̃͗͗̃̓̒͒̈́͑͑̊͋̐͂͊̃̊̈́̈̓̋̏̕̚͜͜͝͝ļ̷̩̖̭͍͇̜̙͕̼̯͔̯̮̮̭̜̈͌̊͑͋̋͛̔̚͘͠k̷̨̢̛̝̙̫̹̱͈̟̥͕̰̼̼̲͈̝̗̳̞̺͈̀́̐͂͋̀͒͋̈͆̾͐́̐s̴̢͔̥̺͙̖̿́̅͘̕ḑ̶̨̛̮̯̪̭̰̤̞̣̻̩̱̂͑͋̓̓̈́̇͂̈́͑̓̈̒̔̂̈́̏̕̚͘͠͠;̷̧̱̗̮̗̥̯̜͙̣̟͓͚̲͓̹̫̠̤̻̬̔͆̾̄͌͑̊̆͂̑͋͋̓͆̎͌̀͆̀̓̿̚͘̚͘͠͠͠ͅf̶̛̠̣͚̳͖͚̈̉͌͐͑̀͛͑̿͝͝͝k̷̨̡̢̛͔̰̗͉̺͚̳͓̺̹͙̈́̐̃̽̈́́̒̈̒͆̽̿͌̈́̓̈̄̾̚") == False 
    assert is_valid('👺🍮🍮🍮🍮🍮🍮🍮🍮  Δⓓ;ㄥ𝕤נ𝒇𝕘нנ𝐨𝔼ฬⓇυเʳｕˣ.ᑕνᵐ ;ⓧＣ𝕃𝓴;đғ𝓸;∂ŜｆҜ;Ŝ𝒹ℱĻк𝕊Ⓓ;ᖴｌＫ𝓼Đ;Ｆк  🎯🎄') == False
    assert is_valid("شسزذدسيپويريل؛سدلفكسد؛لفكچ.،ڢمخ.،ڢمخ.ڢم؛اسدك؛اسلدكد") == False


def test_calculate_expression():
    assert calculate('2+2') == 4
    assert calculate('5*10') == 50
    assert calculate("+-/234234345***-----------------------------------------------------------------------------2315454745") == 'Error'
    